cars = ["mercedes", "BMW", "toyota", "mustang"]
cars[1] = "audi"
cars[2] = "porshe"
print(cars)

# 2) რაში გვეხმარება ინდექსინგი? რა შეგივიძლია გავაკეთოთ ინდექსინგის მეშვეობით? შეგვიძლია თუ არა სტრინგების შეცვლა ინდექსინგით?


# ინდექსინგი გვეხმარება იმაში, რომ მივწვდეთ სტრინგში ან სიაში კონკრეტულ სიმბოლოს ან ელემენტს.
# შეგვიძლია ცვლადის ვნახოთ კონკრეტული ელემენტი
# სტრინგის შცვლა ინდექსინდით შესაძლებელია

txt = ("hello world, python html")
print(txt[0])
print(txt[-21])
# ინდექსები იწყება 0-დან და ითვლება მარცხნიდან მარჯვნივ.
#  უარყოფითი ინდექსები იწყება -1-დან და ითვლება მარჯვნიდან მარცხნივ.